#### Terraform Plan 📝 for `prod/apps/portfolio`
<details><summary>Show Plan</summary>

```

module.static_portfolio.module.acm.data.aws_route53_zone.jordibru_cloud: Reading...
module.static_portfolio.module.r53.data.aws_route53_zone.jordibru_cloud: Reading...
module.static_portfolio.module.acm.data.aws_route53_zone.jordibru_cloud: Read complete after 0s [id=Z0416635OCIECZEMO3JV]
module.static_portfolio.module.r53.data.aws_route53_zone.jordibru_cloud: Read complete after 0s [id=Z0416635OCIECZEMO3JV]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.static_portfolio.module.acm.aws_acm_certificate.domain_certificate will be created
  + resource "aws_acm_certificate" "domain_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "portfolio.jordibru.cloud"
      + domain_validation_options = [
          + {
              + domain_name           = "portfolio.jordibru.cloud"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "portfolio.jordibru.cloud",
        ]
      + tags                      = {
          + "owner"     = "jordi"
          + "stage"     = "prod"
          + "terraform" = "true"
        }
      + tags_all                  = {
          + "owner"     = "jordi"
          + "stage"     = "prod"
          + "terraform" = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.static_portfolio.module.acm.aws_acm_certificate_validation.validations will be created
  + resource "aws_acm_certificate_validation" "validations" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.static_portfolio.module.acm.aws_route53_record.cert_validations["portfolio.jordibru.cloud"] will be created
  + resource "aws_route53_record" "cert_validations" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0416635OCIECZEMO3JV"
    }

  # module.static_portfolio.module.cloudfront.aws_cloudfront_distribution.main_distribution will be created
  + resource "aws_cloudfront_distribution" "main_distribution" {
      + aliases                         = [
          + "portfolio.jordibru.cloud",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "owner"     = "jordi"
          + "stage"     = "prod"
          + "terraform" = "true"
        }
      + tags_all                        = {
          + "owner"     = "jordi"
          + "stage"     = "prod"
          + "terraform" = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = (known after apply)
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "SSLv3",
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.static_portfolio.module.r53.aws_route53_record.record will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "portfolio.jordibru.cloud"
      + type            = "A"
      + zone_id         = "Z0416635OCIECZEMO3JV"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.static_portfolio.module.s3_bucket.data.aws_iam_policy_document.default_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "default_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:Get*",
              + "s3:List*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "*"
            }
        }
    }

  # module.static_portfolio.module.s3_bucket.aws_s3_bucket.main_bucket will be created
  + resource "aws_s3_bucket" "main_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "portfolio.jordibru.cloud"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "owner"     = "jordi"
          + "stage"     = "prod"
          + "terraform" = "true"
        }
      + tags_all                    = {
          + "owner"     = "jordi"
          + "stage"     = "prod"
          + "terraform" = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.static_portfolio.module.s3_bucket.aws_s3_bucket_policy.bucket_policy_for_static_website[0] will be created
  + resource "aws_s3_bucket_policy" "bucket_policy_for_static_website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.static_portfolio.module.s3_bucket.aws_s3_bucket_public_access_block.bucket_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "bucket_access_block" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.static_portfolio.module.s3_bucket.aws_s3_bucket_versioning.bucket_versioning[0] will be created
  + resource "aws_s3_bucket_versioning" "bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.static_portfolio.module.s3_bucket.aws_s3_bucket_website_configuration.bucket_statics[0] will be created
  + resource "aws_s3_bucket_website_configuration" "bucket_statics" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: workspace.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "workspace.plan"

```

</details>

*Pushed by: @JordiiBru, Action: pull_request in Path: `prod/apps/portfolio`*